data/SOAP/req14.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Body>
  <ns3:echoMap xmlns:ns3="http://soapinterop.org/">
   <inputMap href="#id0"/>
  </ns3:echoMap>
  <multiRef id="id0" xsi:type="ns5:Map" xmlns:ns5="http://xml.apache.org/xml-soap">
   <item>
    <key xsi:type="xsd:dateTime">2001-10-05T22:07:04.629Z</key>
    <value xsi:type="xsd:string">string value</value>
   </item>
   <item>
    <key xsi:type="xsd:string">stringKey</key>
    <value xsi:type="xsd:int">5</value>
   </item>
  </multiRef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
